bukepo/ot-nrf528xx/third_party/NordicSemiconductor/drivers/radio/mac_features/ack_generator/nrf_802154_ack_data.c
    // The pending bit is set by default.
    if (!m_pending_bit.enabled || (NULL == p_src_addr))
    {
        return true;
    }

    return addr_index_find(p_src_addr, &location, NRF_802154_ACK_DATA_PENDING_BIT, extended);
}

/**
 * @brief Zigbee implementation of the address matching algorithm.
 *
 * @param[in]  p_frame  Pointer to the frame for which the ACK frame is being prepared.
 *
 * @retval true   Pending bit is to be set.
 * @retval false  Pending bit is to be cleared.
 */
static bool addr_match_zigbee(const uint8_t * p_frame)
{
    uint8_t                            frame_type;
    nrf_802154_frame_parser_mhr_data_t mhr_fields;
    uint32_t                           location;
    const uint8_t                    * p_cmd = p_frame;
    bool                               ret   = false;

    // If ack data generator module is disabled do not perform check, return true by default.
    if (!m_pending_bit.enabled)
    {
        return true;
    }

    // Check the frame type.
    frame_type = (p_frame[FRAME_TYPE_OFFSET] & FRAME_TYPE_MASK);

    // Parse the MAC header and retrieve the command type.
    if (nrf_802154_frame_parser_mhr_parse(p_frame, &mhr_fields))
    {
        // Note: Security header is not included in the offset.
        // If security is to be used at any point, additional calculation
        // in nrf_802154_frame_parser_mhr_parse needs to be implemented.
        p_cmd += mhr_fields.addressing_end_offset;
    }
    else
    {
        // If invalid source or destination addressing mode is detected, assume unknown device.
        // Command type cannot be checked, as addressing_end_offset value will be invalid.
        return true;
    }

    // Check frame type and command type.
    if ((frame_type == FRAME_TYPE_COMMAND) && (*p_cmd == MAC_CMD_DATA_REQ))
    {
        // Check addressing type - in long case address, pb should always be 1.
        if (mhr_fields.src_addr_size == SHORT_ADDRESS_SIZE)
        {
            // Return true if address is not found on the m_pending_bits list.
            ret = !addr_index_find(mhr_fields.p_src_addr,
                                   &location,
                                   NRF_802154_ACK_DATA_PENDING_BIT,
                                   false);
        }
        else
        {
            ret = true;
        }
    }

    return ret;
}

/**
 * @brief Standard-compliant implementation of the address matching algorithm.
 *
 * Function always returns true. It is IEEE 802.15.4 compliant, as per 6.7.3.
 * Higher layer should ensure empty data frame with no AR is sent afterwards.
 *
 * @param[in]  p_frame  Pointer to the frame for which the ACK frame is being prepared.
 *
 * @retval true   Pending bit is to be set.
 */
static bool addr_match_standard_compliant(const uint8_t * p_frame)
{
    (void)p_frame;
    return true;
}

/**
 * @brief Add an address to the address list in ascending order.
 *
 * @param[in]  p_addr           Pointer to the address to be added.
 * @param[in]  location         Index of the location where @p p_addr should be added.
 * @param[in]  extended         Indication if @p p_addr is an extended or a short addresses.
 *
 * @retval true   Address @p p_addr has been added to the list successfully.
 * @retval false  Address @p p_addr could not be added to the list.
 */
static bool addr_add(const uint8_t * p_addr, uint32_t location, uint8_t data_type, bool extended)
{
    uint32_t * p_addr_array_len;
    uint32_t   max_addr_array_len;
    uint8_t  * p_addr_array;
    uint8_t    entry_size;
    bool       valid_data_type = true;

    switch (data_type)
    {
        case NRF_802154_ACK_DATA_PENDING_BIT:
            if (extended)
            {
                p_addr_array       = (uint8_t *)m_pending_bit.extended_addr;
                max_addr_array_len = NUM_EXTENDED_ADDRESSES;
                p_addr_array_len   = &m_pending_bit.num_of_ext_addr;
                entry_size         = EXTENDED_ADDRESS_SIZE;
            }
            else
            {
                p_addr_array       = (uint8_t *)m_pending_bit.short_addr;
                max_addr_array_len = NUM_SHORT_ADDRESSES;
                p_addr_array_len   = &m_pending_bit.num_of_short_addr;
                entry_size         = SHORT_ADDRESS_SIZE;
            }
            break;

        case NRF_802154_ACK_DATA_IE:
            if (extended)
            {
                p_addr_array       = (uint8_t *)m_ie.ext_data;
                max_addr_array_len = NUM_EXTENDED_ADDRESSES;
                p_addr_array_len   = &m_ie.num_of_ext_data;
                entry_size         = sizeof(ack_ext_ie_data_t);
            }
            else
            {
                p_addr_array       = (uint8_t *)m_ie.short_data;
                max_addr_array_len = NUM_SHORT_ADDRESSES;
                p_addr_array_len   = &m_ie.num_of_short_data;
                entry_size         = sizeof(ack_short_ie_data_t);
            }
            break;

        default:
            valid_data_type = false;
            assert(false);
            break;
    }

    if (!valid_data_type || (*p_addr_array_len == max_addr_array_len))
    {
        return false;
    }

    memmove(p_addr_array + entry_size * (location + 1),
            p_addr_array + entry_size * (location),
            (*p_addr_array_len - location) * entry_size);

    memcpy(p_addr_array + entry_size * location,
           p_addr,
           extended ? EXTENDED_ADDRESS_SIZE : SHORT_ADDRESS_SIZE);

    (*p_addr_array_len)++;

    return true;
}

static const uint8_t *ext_ie_data = NULL;
static uint8_t ext_ie_data_len = 0;
static const uint8_t *short_ie_data = NULL;
static uint8_t short_ie_data_len = 0;

/**
 * @brief Remove an address from the address list keeping it in ascending order.
 *
 * @param[in]  location     Index of the element to be removed from the list.
 * @param[in]  extended     Indication if address to remove is an extended or a short address.
 *
 * @retval true   Address @p p_addr has been removed from the list successfully.
 * @retval false  Address @p p_addr could not removed from the list.
 */
static bool addr_remove(uint32_t location, uint8_t data_type, bool extended)
{
    uint32_t * p_addr_array_len;
    uint8_t  * p_addr_array;
    uint8_t    entry_size;
    bool       valid_data_type = true;

    switch (data_type)
    {
        case NRF_802154_ACK_DATA_PENDING_BIT:
            if (extended)
            {
                p_addr_array     = (uint8_t *)m_pending_bit.extended_addr;
                p_addr_array_len = &m_pending_bit.num_of_ext_addr;
                entry_size       = EXTENDED_ADDRESS_SIZE;
            }
            else
            {
                p_addr_array     = (uint8_t *)m_pending_bit.short_addr;
                p_addr_array_len = &m_pending_bit.num_of_short_addr;
                entry_size       = SHORT_ADDRESS_SIZE;
            }
            break;

        case NRF_802154_ACK_DATA_IE:
            if (extended)
            {
                p_addr_array     = (uint8_t *)m_ie.ext_data;
                p_addr_array_len = &m_ie.num_of_ext_data;
                entry_size       = sizeof(ack_ext_ie_data_t);

                ext_ie_data = NULL;
                ext_ie_data_len = 0;
            }
            else
            {
                p_addr_array     = (uint8_t *)m_ie.short_data;
                p_addr_array_len = &m_ie.num_of_short_data;
                entry_size       = sizeof(ack_short_ie_data_t);

