bukepo/ot-nrf528xx/third_party/NordicSemiconductor/drivers/radio/mac_features/ack_generator/nrf_802154_ack_data.c
                short_ie_data = NULL;
                short_ie_data_len = 0;
            }
            break;

        default:
            valid_data_type = false;
            assert(false);
            break;
    }

    if (!valid_data_type || (*p_addr_array_len == 0))
    {
        return false;
    }

    memmove(p_addr_array + entry_size * location,
            p_addr_array + entry_size * (location + 1),
            (*p_addr_array_len - location - 1) * entry_size);

    (*p_addr_array_len)--;

    return true;
}

static void ie_data_add(uint32_t location, bool extended, const uint8_t * p_data, uint8_t data_len)
{
    if (extended)
    {
        memcpy(m_ie.ext_data[location].ie_data.p_data, p_data, data_len);
        m_ie.ext_data[location].ie_data.len = data_len;

        ext_ie_data = m_ie.ext_data[location].ie_data.p_data;
        ext_ie_data_len = m_ie.ext_data[location].ie_data.len;
    }
    else
    {
        memcpy(m_ie.short_data[location].ie_data.p_data, p_data, data_len);
        m_ie.short_data[location].ie_data.len = data_len;

        short_ie_data = m_ie.short_data[location].ie_data.p_data;
        short_ie_data_len = m_ie.short_data[location].ie_data.len;
    }
}

/***************************************************************************************************
 * @section Public API
 **************************************************************************************************/

void nrf_802154_ack_data_init(void)
{
    memset(&m_pending_bit, 0, sizeof(m_pending_bit));
    memset(&m_ie, 0, sizeof(m_ie));

    m_pending_bit.enabled = true;
    m_src_matching_method = NRF_802154_SRC_ADDR_MATCH_THREAD;
}

void nrf_802154_ack_data_enable(bool enabled)
{
    m_pending_bit.enabled = enabled;
}

bool nrf_802154_ack_data_for_addr_set(const uint8_t * p_addr,
                                      bool            extended,
                                      uint8_t         data_type,
                                      const void    * p_data,
                                      uint8_t         data_len)
{
    uint32_t location = 0;

    if (addr_index_find(p_addr, &location, data_type, extended) ||
        addr_add(p_addr, location, data_type, extended))
    {
        if (data_type == NRF_802154_ACK_DATA_IE)
        {
            ie_data_add(location, extended, p_data, data_len);
        }

        return true;
    }
    else
    {
        return false;
    }
}

bool nrf_802154_ack_data_for_addr_clear(const uint8_t * p_addr, bool extended, uint8_t data_type)
{
    uint32_t location = 0;

    if (addr_index_find(p_addr, &location, data_type, extended))
    {
        return addr_remove(location, data_type, extended);
    }
    else
    {
        return false;
    }
}

void nrf_802154_ack_data_reset(bool extended, uint8_t data_type)
{
    switch (data_type)
    {
        case NRF_802154_ACK_DATA_PENDING_BIT:
            if (extended)
            {
                m_pending_bit.num_of_ext_addr = 0;
            }
            else
            {
                m_pending_bit.num_of_short_addr = 0;
            }
            break;

        case NRF_802154_ACK_DATA_IE:
            if (extended)
            {
                m_ie.num_of_ext_data = 0;
            }
            else
            {
                m_ie.num_of_short_data = 0;
            }
            break;

        default:
            break;
    }
}

void nrf_802154_ack_data_src_addr_matching_method_set(nrf_802154_src_addr_match_t match_method)
{
    switch (match_method)
    {
        case NRF_802154_SRC_ADDR_MATCH_THREAD:
        case NRF_802154_SRC_ADDR_MATCH_ZIGBEE:
        case NRF_802154_SRC_ADDR_MATCH_ALWAYS_1:
            m_src_matching_method = match_method;
            break;

        default:
            assert(false);
    }

}

bool nrf_802154_ack_data_pending_bit_should_be_set(const uint8_t * p_frame)
{
    bool ret;

    switch (m_src_matching_method)
    {
        case NRF_802154_SRC_ADDR_MATCH_THREAD:
            ret = addr_match_thread(p_frame);
            break;

        case NRF_802154_SRC_ADDR_MATCH_ZIGBEE:
            ret = addr_match_zigbee(p_frame);
            break;

        case NRF_802154_SRC_ADDR_MATCH_ALWAYS_1:
            ret = addr_match_standard_compliant(p_frame);
            break;

        default:
            assert(false);
            ret = false;
    }

    return ret;
}

const uint8_t * nrf_802154_ack_data_ie_get(const uint8_t * p_src_addr,
                                           bool            src_addr_extended,
                                           uint8_t       * p_ie_length)
{
    uint32_t location;

    if (NULL == p_src_addr)
    {
        return NULL;
    }

    if (addr_index_find(p_src_addr, &location, NRF_802154_ACK_DATA_IE, src_addr_extended))
    {
        if (src_addr_extended)
        {
            *p_ie_length = m_ie.ext_data[location].ie_data.len;
            return m_ie.ext_data[location].ie_data.p_data;
        }
        else
        {
            *p_ie_length = m_ie.short_data[location].ie_data.len;
            return m_ie.short_data[location].ie_data.p_data;
        }
    }
    else
    {
        if (src_addr_extended) {
            *p_ie_length = ext_ie_data_len;
            return ext_ie_data;
        } else {
            *p_ie_length = short_ie_data_len;
            return short_ie_data;
        }
    }
}
